In [1]:
import pandas
pandas.__version__

'1.4.2'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([567,1588,869,105])
counts

0     567
1    1588
2     869
3     105
dtype: int64

In [4]:
counts.values

array([ 567, 1588,  869,  105], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
bacteria = pd.Series([567, 1588, 889, 1055], 
    index=['Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes'])

bacteria

Firmicutes         567
Proteobacteria    1588
Actinobacteria     889
Bacteroidetes     1055
dtype: int64

In [7]:
bacteria['Proteobacteria']

1588

In [8]:
bacteria[0]

567

In [9]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Firmicutes         567
Proteobacteria    1588
Actinobacteria     889
Bacteroidetes     1055
Name: counts, dtype: int64

In [10]:
np.log(bacteria)

phylum
Firmicutes        6.340359
Proteobacteria    7.370231
Actinobacteria    6.790097
Bacteroidetes     6.961296
Name: counts, dtype: float64

In [11]:
bacteria[bacteria>1000]

phylum
Proteobacteria    1588
Bacteroidetes     1055
Name: counts, dtype: int64

In [12]:
bacteria_dict = {'Firmicutes': 567, 'Proteobacteria': 1588, 'Actinobacteria': 889, 'Bacteroidetes': 1055}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 567, 'Proteobacteria': 1588, 'Actinobacteria': 889, 'Bacteroidetes': 1055}

Firmicutes         567
Proteobacteria    1588
Actinobacteria     889
Bacteroidetes     1055
dtype: int64

In [13]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [14]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [15]:
df['nonsense'] = df.Year / df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [16]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [17]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [18]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [19]:
data = [{'a': i, 'b':10* i}for i in range(8)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}, {'a': 6, 'b': 60}, {'a': 7, 'b': 70}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50
6  6  60
7  7  70

In [20]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [21]:
import pandas as pd
import numpy as np
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    2    2
b    2    2
c    2    2

In [22]:
ind = pd.Index([20, 34, 57, 7, 1, 8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [23]:
ind[1]

34

In [24]:
ind[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [25]:
print(ind.size, ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [26]:
ind[2] = 0

TypeError: Index does not support mutable operations

In [ ]:
import numpy as np
import pandas as pd
rng = np.random.RandomState(10)
ser = pd.Series(rng.randint(0, 10, 4))
ser

In [ ]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

In [ ]:
np.exp(ser)

In [ ]:
np.sin(dfr * np.pi / 4)

In [ ]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

In [ ]:
population / area

In [ ]:
area.index | population.index

In [ ]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A + B

In [ ]:
A.add(B, fill_value=0)

In [ ]:
df

In [ ]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

In [ ]:
  # merge is smart! If there are overlapping names, it uses those for the merge
df.merge(df2)

In [ ]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

In [ ]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

In [ ]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

In [ ]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [ ]:
serie_a

In [ ]:
serie_b

In [27]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

NameError: name 'serie_a' is not defined

In [28]:
serie_a.combine_first(serie_b)

NameError: name 'serie_a' is not defined

In [29]:
serie_a.combine_first(serie_a)

NameError: name 'serie_a' is not defined